### How will you add a column to a pandas DataFrame?

In [47]:
import pandas as pd
data= {'A':[1,2,3,4],'B':[5,6,7,8],'C':[9,10,11,12]}
df = pd.DataFrame(data)

In [48]:
df['D'] = pd.Series([14,15,16,17])
df

   A  B   C   D
0  1  5   9  14
1  2  6  10  15
2  3  7  11  16
3  4  8  12  17

In [49]:
data= {'A':[1,2,3,4],'B':[5,6,7,8],'C':[9,10,11,12]}
df = pd.DataFrame(data,index=['p','q','r','s'])
df

   A  B   C
p  1  5   9
q  2  6  10
r  3  7  11
s  4  8  12

In [50]:
df['D'] = pd.Series([13,14,15],index=['p','q','r'],dtype = int)
df

   A  B   C     D
p  1  5   9  13.0
q  2  6  10  14.0
r  3  7  11  15.0
s  4  8  12   NaN

### How to add row to dataframe

In [51]:
df.loc['t']= [7,6,4,9]
df

   A  B   C     D
p  1  5   9  13.0
q  2  6  10  14.0
r  3  7  11  15.0
s  4  8  12   NaN
t  7  6   4   9.0

### How to change Col name

In [54]:
df.rename(columns= {'D': 'E'},inplace=True)

In [55]:
df

   A  B   C     E
p  1  5   9  13.0
q  2  6  10  14.0
r  3  7  11  15.0
s  4  8  12   NaN
t  7  6   4   9.0